In [2]:
import pandas as pd

### Задание 1

In [ ]:
# Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера.
# Определите какому фильму было выставлено больше всего оценок 5.0.

In [57]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
movie = pd.read_csv('ml-latest-small/movies.csv')

In [60]:
ratings_grouped = ratings[ratings['rating'] == 5].groupby('movieId').count().sort_values('userId', ascending=False)

In [59]:
joined = ratings_grouped.merge(movie, on = 'movieId', how = 'left')
joined.head()

,movieId,userId,rating,timestamp,title,genres
0,318,153,153,153,"Shawshank Redemption, The (1994)",Crime|Drama
1,296,123,123,123,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
2,356,116,116,116,Forrest Gump (1994),Comedy|Drama|Romance|War
3,2571,109,109,109,"Matrix, The (1999)",Action|Sci-Fi|Thriller
4,260,104,104,104,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Sci-Fi

### Задание 2

In [ ]:
# По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония)
# категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [3]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [4]:
# группировка данных по условию
power_baltic = power[(power['country'] == 'Latvia') | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')]
power_baltic = power_baltic[(power_baltic['category'] == 4) | (power_baltic['category'] == 12) | (power_baltic['category'] == 21)]
power_baltic = power_baltic[(power_baltic['year'] >= 2005) & (power_baltic['year'] <= 2010)]
power_baltic = power_baltic[(power_baltic['quantity'] >= 0)]

power_baltic.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [19]:
power_baltic['quantity'].sum()

240580.0

### Задание 3

In [ ]:
# Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
# Примеры страниц (необязательно брать именно эти):
# https://fortrader.org/quotes
# https://www.finanz.ru/valyuty/v-realnom-vremeni

In [27]:
table = pd.read_html('https://fortrader.org/quotes')[1]
table

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,65.99,-0.03,-0.05,NaN
1,Нефть WTI Цены на нефть WTI,62.06,0.00,0.00,NaN
2,Природный газ Цена на природный газ,2.72,0.00,0.00,NaN
3,Кофе,138.70,0.00,0.00,NaN
4,Кукуруза,657.40,-0.60,-0.09,NaN
5,Соя,422.00,0.40,0.09,NaN
6,Хлопок,88.80,0.00,0.00,NaN

In [28]:
type(table)

pandas.core.frame.DataFrame